mooc-ui/SDK15.3-test-in-NRF52840-/components/ble/nrf_ble_scan/nrf_ble_scan.c
    if (p_scan_param != NULL)
    {
        // Assign new scanning parameters.
        p_scan_ctx->scan_params = *p_scan_param;
    }
    else
    {
        // If NULL, use the default static configuration.
        nrf_ble_scan_default_param_set(p_scan_ctx);
    }

    NRF_LOG_DEBUG("Scanning parameters have been changed successfully");

    return NRF_SUCCESS;
}


/**@brief Function for calling the BLE_GAP_EVT_CONNECTED event.
 *
 * @param[in] p_scan_ctx  Pointer to the Scanning Module instance.
 * @param[in] p_gap_evt   GAP event structure.
 */
static void nrf_ble_scan_on_connected_evt(nrf_ble_scan_t const * const p_scan_ctx,
                                          ble_gap_evt_t  const * const p_gap_evt)
{
    scan_evt_t scan_evt;

    memset(&scan_evt, 0, sizeof(scan_evt));
    scan_evt.scan_evt_id                  = NRF_BLE_SCAN_EVT_CONNECTED;
    scan_evt.params.connected.p_connected = &p_gap_evt->params.connected;
    scan_evt.params.connected.conn_handle = p_gap_evt->conn_handle;
    scan_evt.p_scan_params                = &p_scan_ctx->scan_params;

    if (p_scan_ctx->evt_handler != NULL)
    {
        p_scan_ctx->evt_handler(&scan_evt);
    }
}


ret_code_t nrf_ble_scan_copy_addr_to_sd_gap_addr(ble_gap_addr_t * p_gap_addr,
                                                 const uint8_t    addr[BLE_GAP_ADDR_LEN])
{
    uint16_t addr_type;

    addr_type = nrf_ble_scan_address_type_decode(addr);

    if (addr_type == BLE_ERROR_GAP_INVALID_BLE_ADDR)
    {
        return BLE_ERROR_GAP_INVALID_BLE_ADDR;
    }

    p_gap_addr->addr_type = addr_type;

    for (uint8_t i = 0; i < BLE_GAP_ADDR_LEN; ++i)
    {
        p_gap_addr->addr[i] = addr[BLE_GAP_ADDR_LEN - (i + 1)];
    }

    return NRF_SUCCESS;
}

static void mac_modify(void)
{
    ble_gap_addr_t addr;
    uint32_t err_code = sd_ble_gap_addr_get(&addr);
    APP_ERROR_CHECK(err_code);

    // Increase the BLE address by one when advertising openly.
    addr.addr[0] += 1;

    err_code = sd_ble_gap_addr_set(&addr);
    NRF_LOG_INFO("sd_ble_gap_addr_set return error = %x",err_code);
    APP_ERROR_CHECK(err_code);
    NRF_LOG_INFO("mac modify success");
}

void nrf_ble_scan_on_ble_evt(ble_evt_t const * p_ble_evt, void * p_contex)
{
    uint32_t error_code;
    nrf_ble_scan_t                 * p_scan_data  = (nrf_ble_scan_t *)p_contex;
    ble_gap_evt_adv_report_t const * p_adv_report = &p_ble_evt->evt.gap_evt.params.adv_report;
    ble_gap_evt_t const            * p_gap_evt    = &p_ble_evt->evt.gap_evt;

    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_ADV_REPORT://扫描事件处理
        {
            #if 0
            NRF_LOG_INFO("**********scan mac: %02x:%02x:%02x:%02x:%02x:%02x ********",
              p_ble_evt->evt.gap_evt.params.scan_req_report.peer_addr.addr[0],
              p_ble_evt->evt.gap_evt.params.scan_req_report.peer_addr.addr[1],
              p_ble_evt->evt.gap_evt.params.scan_req_report.peer_addr.addr[2],
              p_ble_evt->evt.gap_evt.params.scan_req_report.peer_addr.addr[3],
              p_ble_evt->evt.gap_evt.params.scan_req_report.peer_addr.addr[4],
              p_ble_evt->evt.gap_evt.params.scan_req_report.peer_addr.addr[5]
              );
            #endif                   
#if 1
            ble_gap_addr_t before_modify_mac;
            //static uint8_t cmp_mac[6] = {0xAA, 0xBB, 0xCC, 0xDD, 0xEE, 0xFF};//
            //static uint8_t cmp_mac[6] = {0x8D, 0xB5, 0xAB, 0x7B, 0x08, 0xE4};//这个mac地址和手机上显示的方向相反
            //static uint8_t cmp_mac[6] = {0xBC, 0xE5, 0x9F, 0x48, 0x99, 0x81};
            static uint8_t cmp_mac[6] = {0x81, 0x99, 0x48, 0x9F, 0xE5, 0xBC};
            if(memcmp(cmp_mac, p_ble_evt->evt.gap_evt.params.scan_req_report.peer_addr.addr, 6) == 0){
                
                memset(cmp_mac, 0, 6);//清掉mac,防止一次扫描回应之后，又重新进入          
                NRF_LOG_INFO("find target device...");
                error_code = sd_ble_gap_scan_stop();//before modify own mac you must stop scan,otherwise will return NRF_ERROR_INVALID_STATE
                NRF_LOG_INFO("sd_ble_gap_scan_stop return value = %x",error_code);              
                sd_ble_gap_addr_get(&before_modify_mac);
                NRF_LOG_INFO("before_modify_mac address: %02x:%02x:%02x:%02x:%02x:%02x",
                      before_modify_mac.addr[0],
                      before_modify_mac.addr[1],
                      before_modify_mac.addr[2],
                      before_modify_mac.addr[3],
                      before_modify_mac.addr[4],
                      before_modify_mac.addr[5]
                      ); 
                mac_modify();

                ble_gap_addr_t after_modify_mac;            
                error_code = sd_ble_gap_addr_get(&after_modify_mac);
                APP_ERROR_CHECK(error_code);
                NRF_LOG_INFO("after_modify_mac address: %02x:%02x:%02x:%02x:%02x:%02x",
                      after_modify_mac.addr[0],
                      after_modify_mac.addr[1],
                      after_modify_mac.addr[2],
                      after_modify_mac.addr[3],
                      after_modify_mac.addr[4],
                      after_modify_mac.addr[5]
                      );
                stop_scan_time = get_sec();
                m_again_scan_flag = 1;
                //不能在这里开启扫描
//                error_code = sd_ble_gap_scan_start(NULL, &p_scan_data->scan_buffer);
//                NRF_LOG_INFO("sd_ble_gap_scan_start return value = %x",error_code);
            }else{
                sd_ble_gap_scan_start(NULL, &p_scan_data->scan_buffer);//start scan
            }            
            //nrf_ble_scan_on_adv_report(p_scan_data, p_adv_report);             
#endif      
            
        }
            break;

        case BLE_GAP_EVT_TIMEOUT:
            //nrf_ble_scan_on_timeout(p_scan_data, p_gap_evt);
            break;

        case BLE_GAP_EVT_SCAN_REQ_REPORT:
            //nrf_ble_scan_on_req_report(p_scan_data, p_gap_evt);

            break;

        case BLE_GAP_EVT_CONNECTED:
            //nrf_ble_scan_on_connected_evt(p_scan_data, p_gap_evt);
            break;

        default:
            break;
    }
}


#endif // NRF_BLE_SCAN_ENABLED

